codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz2048efg064.h
#define _PMSTAT_IB1F_POSITION                    0x00000009
#define _PMSTAT_IB1F_MASK                        0x00000200
#define _PMSTAT_IB1F_LENGTH                      0x00000001

#define _PMSTAT_IB2F_POSITION                    0x0000000A
#define _PMSTAT_IB2F_MASK                        0x00000400
#define _PMSTAT_IB2F_LENGTH                      0x00000001

#define _PMSTAT_IB3F_POSITION                    0x0000000B
#define _PMSTAT_IB3F_MASK                        0x00000800
#define _PMSTAT_IB3F_LENGTH                      0x00000001

#define _PMSTAT_IBOV_POSITION                    0x0000000E
#define _PMSTAT_IBOV_MASK                        0x00004000
#define _PMSTAT_IBOV_LENGTH                      0x00000001

#define _PMSTAT_IBF_POSITION                     0x0000000F
#define _PMSTAT_IBF_MASK                         0x00008000
#define _PMSTAT_IBF_LENGTH                       0x00000001

#define _PMSTAT_w_POSITION                       0x00000000
#define _PMSTAT_w_MASK                           0xFFFFFFFF
#define _PMSTAT_w_LENGTH                         0x00000020

#define _PMWADDR_WADDR_POSITION                  0x00000000
#define _PMWADDR_WADDR_MASK                      0x00003FFF
#define _PMWADDR_WADDR_LENGTH                    0x0000000E

#define _PMWADDR_WADDR14_POSITION                0x0000000E
#define _PMWADDR_WADDR14_MASK                    0x00004000
#define _PMWADDR_WADDR14_LENGTH                  0x00000001

#define _PMWADDR_WADDR15_POSITION                0x0000000F
#define _PMWADDR_WADDR15_MASK                    0x00008000
#define _PMWADDR_WADDR15_LENGTH                  0x00000001

#define _PMWADDR_WCS_POSITION                    0x0000000E
#define _PMWADDR_WCS_MASK                        0x0000C000
#define _PMWADDR_WCS_LENGTH                      0x00000002

#define _PMWADDR_WCS1_POSITION                   0x0000000E
#define _PMWADDR_WCS1_MASK                       0x00004000
#define _PMWADDR_WCS1_LENGTH                     0x00000001

#define _PMWADDR_WCS2_POSITION                   0x0000000F
#define _PMWADDR_WCS2_MASK                       0x00008000
#define _PMWADDR_WCS2_LENGTH                     0x00000001

#define _PMWADDR_w_POSITION                      0x00000000
#define _PMWADDR_w_MASK                          0xFFFFFFFF
#define _PMWADDR_w_LENGTH                        0x00000020

#define _PMRADDR_RADDR_POSITION                  0x00000000
#define _PMRADDR_RADDR_MASK                      0x00003FFF
#define _PMRADDR_RADDR_LENGTH                    0x0000000E

#define _PMRADDR_RADDR14_POSITION                0x0000000E
#define _PMRADDR_RADDR14_MASK                    0x00004000
#define _PMRADDR_RADDR14_LENGTH                  0x00000001

#define _PMRADDR_RADDR15_POSITION                0x0000000F
#define _PMRADDR_RADDR15_MASK                    0x00008000
#define _PMRADDR_RADDR15_LENGTH                  0x00000001

#define _PMRADDR_RCS_POSITION                    0x0000000E
#define _PMRADDR_RCS_MASK                        0x0000C000
#define _PMRADDR_RCS_LENGTH                      0x00000002

#define _PMRADDR_RCS1_POSITION                   0x0000000E
#define _PMRADDR_RCS1_MASK                       0x00004000
#define _PMRADDR_RCS1_LENGTH                     0x00000001

#define _PMRADDR_RCS2_POSITION                   0x0000000F
#define _PMRADDR_RCS2_MASK                       0x00008000
#define _PMRADDR_RCS2_LENGTH                     0x00000001

#define _PMRADDR_w_POSITION                      0x00000000
#define _PMRADDR_w_MASK                          0xFFFFFFFF
#define _PMRADDR_w_LENGTH                        0x00000020

#define _PMRDIN_RDATAIN_POSITION                 0x00000000
#define _PMRDIN_RDATAIN_MASK                     0xFFFFFFFF
#define _PMRDIN_RDATAIN_LENGTH                   0x00000020

#define _PMRDIN_w_POSITION                       0x00000000
#define _PMRDIN_w_MASK                           0xFFFFFFFF
#define _PMRDIN_w_LENGTH                         0x00000020

#define _T1CON_TCS_POSITION                      0x00000001
#define _T1CON_TCS_MASK                          0x00000002
#define _T1CON_TCS_LENGTH                        0x00000001

#define _T1CON_TSYNC_POSITION                    0x00000002
#define _T1CON_TSYNC_MASK                        0x00000004
#define _T1CON_TSYNC_LENGTH                      0x00000001

#define _T1CON_TCKPS_POSITION                    0x00000004
#define _T1CON_TCKPS_MASK                        0x00000030
#define _T1CON_TCKPS_LENGTH                      0x00000002

#define _T1CON_TGATE_POSITION                    0x00000007
#define _T1CON_TGATE_MASK                        0x00000080
#define _T1CON_TGATE_LENGTH                      0x00000001

#define _T1CON_TWIP_POSITION                     0x0000000B
#define _T1CON_TWIP_MASK                         0x00000800
#define _T1CON_TWIP_LENGTH                       0x00000001

#define _T1CON_TWDIS_POSITION                    0x0000000C
#define _T1CON_TWDIS_MASK                        0x00001000
#define _T1CON_TWDIS_LENGTH                      0x00000001

#define _T1CON_SIDL_POSITION                     0x0000000D
#define _T1CON_SIDL_MASK                         0x00002000
#define _T1CON_SIDL_LENGTH                       0x00000001

#define _T1CON_ON_POSITION                       0x0000000F
#define _T1CON_ON_MASK                           0x00008000
#define _T1CON_ON_LENGTH                         0x00000001

#define _T1CON_TCKPS0_POSITION                   0x00000004
#define _T1CON_TCKPS0_MASK                       0x00000010
#define _T1CON_TCKPS0_LENGTH                     0x00000001

#define _T1CON_TCKPS1_POSITION                   0x00000005
#define _T1CON_TCKPS1_MASK                       0x00000020
#define _T1CON_TCKPS1_LENGTH                     0x00000001

#define _T1CON_TSIDL_POSITION                    0x0000000D
#define _T1CON_TSIDL_MASK                        0x00002000
#define _T1CON_TSIDL_LENGTH                      0x00000001

#define _T1CON_TON_POSITION                      0x0000000F
#define _T1CON_TON_MASK                          0x00008000
#define _T1CON_TON_LENGTH                        0x00000001

#define _T1CON_w_POSITION                        0x00000000
#define _T1CON_w_MASK                            0xFFFFFFFF
#define _T1CON_w_LENGTH                          0x00000020

