codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz2048efg064.h
#define _ADCCMPEN4_CMPE0_POSITION                0x00000000
#define _ADCCMPEN4_CMPE0_MASK                    0x00000001
#define _ADCCMPEN4_CMPE0_LENGTH                  0x00000001

#define _ADCCMPEN4_CMPE1_POSITION                0x00000001
#define _ADCCMPEN4_CMPE1_MASK                    0x00000002
#define _ADCCMPEN4_CMPE1_LENGTH                  0x00000001

#define _ADCCMPEN4_CMPE2_POSITION                0x00000002
#define _ADCCMPEN4_CMPE2_MASK                    0x00000004
#define _ADCCMPEN4_CMPE2_LENGTH                  0x00000001

#define _ADCCMPEN4_CMPE3_POSITION                0x00000003
#define _ADCCMPEN4_CMPE3_MASK                    0x00000008
#define _ADCCMPEN4_CMPE3_LENGTH                  0x00000001

#define _ADCCMPEN4_CMPE4_POSITION                0x00000004
#define _ADCCMPEN4_CMPE4_MASK                    0x00000010
#define _ADCCMPEN4_CMPE4_LENGTH                  0x00000001

#define _ADCCMPEN4_CMPE5_POSITION                0x00000005
#define _ADCCMPEN4_CMPE5_MASK                    0x00000020
#define _ADCCMPEN4_CMPE5_LENGTH                  0x00000001

#define _ADCCMPEN4_CMPE6_POSITION                0x00000006
#define _ADCCMPEN4_CMPE6_MASK                    0x00000040
#define _ADCCMPEN4_CMPE6_LENGTH                  0x00000001

#define _ADCCMPEN4_CMPE7_POSITION                0x00000007
#define _ADCCMPEN4_CMPE7_MASK                    0x00000080
#define _ADCCMPEN4_CMPE7_LENGTH                  0x00000001

#define _ADCCMPEN4_CMPE8_POSITION                0x00000008
#define _ADCCMPEN4_CMPE8_MASK                    0x00000100
#define _ADCCMPEN4_CMPE8_LENGTH                  0x00000001

#define _ADCCMPEN4_CMPE9_POSITION                0x00000009
#define _ADCCMPEN4_CMPE9_MASK                    0x00000200
#define _ADCCMPEN4_CMPE9_LENGTH                  0x00000001

#define _ADCCMPEN4_CMPE10_POSITION               0x0000000A
#define _ADCCMPEN4_CMPE10_MASK                   0x00000400
#define _ADCCMPEN4_CMPE10_LENGTH                 0x00000001

#define _ADCCMPEN4_CMPE11_POSITION               0x0000000B
#define _ADCCMPEN4_CMPE11_MASK                   0x00000800
#define _ADCCMPEN4_CMPE11_LENGTH                 0x00000001

#define _ADCCMPEN4_CMPE12_POSITION               0x0000000C
#define _ADCCMPEN4_CMPE12_MASK                   0x00001000
#define _ADCCMPEN4_CMPE12_LENGTH                 0x00000001

#define _ADCCMPEN4_CMPE13_POSITION               0x0000000D
#define _ADCCMPEN4_CMPE13_MASK                   0x00002000
#define _ADCCMPEN4_CMPE13_LENGTH                 0x00000001

#define _ADCCMPEN4_CMPE14_POSITION               0x0000000E
#define _ADCCMPEN4_CMPE14_MASK                   0x00004000
#define _ADCCMPEN4_CMPE14_LENGTH                 0x00000001

#define _ADCCMPEN4_CMPE15_POSITION               0x0000000F
#define _ADCCMPEN4_CMPE15_MASK                   0x00008000
#define _ADCCMPEN4_CMPE15_LENGTH                 0x00000001

#define _ADCCMPEN4_CMPE16_POSITION               0x00000010
#define _ADCCMPEN4_CMPE16_MASK                   0x00010000
#define _ADCCMPEN4_CMPE16_LENGTH                 0x00000001

#define _ADCCMPEN4_CMPE17_POSITION               0x00000011
#define _ADCCMPEN4_CMPE17_MASK                   0x00020000
#define _ADCCMPEN4_CMPE17_LENGTH                 0x00000001

#define _ADCCMPEN4_CMPE18_POSITION               0x00000012
#define _ADCCMPEN4_CMPE18_MASK                   0x00040000
#define _ADCCMPEN4_CMPE18_LENGTH                 0x00000001

#define _ADCCMP4_DCMPLO_POSITION                 0x00000000
#define _ADCCMP4_DCMPLO_MASK                     0x0000FFFF
#define _ADCCMP4_DCMPLO_LENGTH                   0x00000010

#define _ADCCMP4_DCMPHI_POSITION                 0x00000010
#define _ADCCMP4_DCMPHI_MASK                     0xFFFF0000
#define _ADCCMP4_DCMPHI_LENGTH                   0x00000010

#define _ADCCMPEN5_CMPE0_POSITION                0x00000000
#define _ADCCMPEN5_CMPE0_MASK                    0x00000001
#define _ADCCMPEN5_CMPE0_LENGTH                  0x00000001

#define _ADCCMPEN5_CMPE1_POSITION                0x00000001
#define _ADCCMPEN5_CMPE1_MASK                    0x00000002
#define _ADCCMPEN5_CMPE1_LENGTH                  0x00000001

#define _ADCCMPEN5_CMPE2_POSITION                0x00000002
#define _ADCCMPEN5_CMPE2_MASK                    0x00000004
#define _ADCCMPEN5_CMPE2_LENGTH                  0x00000001

#define _ADCCMPEN5_CMPE3_POSITION                0x00000003
#define _ADCCMPEN5_CMPE3_MASK                    0x00000008
#define _ADCCMPEN5_CMPE3_LENGTH                  0x00000001

#define _ADCCMPEN5_CMPE4_POSITION                0x00000004
#define _ADCCMPEN5_CMPE4_MASK                    0x00000010
#define _ADCCMPEN5_CMPE4_LENGTH                  0x00000001

#define _ADCCMPEN5_CMPE5_POSITION                0x00000005
#define _ADCCMPEN5_CMPE5_MASK                    0x00000020
#define _ADCCMPEN5_CMPE5_LENGTH                  0x00000001

#define _ADCCMPEN5_CMPE6_POSITION                0x00000006
#define _ADCCMPEN5_CMPE6_MASK                    0x00000040
#define _ADCCMPEN5_CMPE6_LENGTH                  0x00000001

#define _ADCCMPEN5_CMPE7_POSITION                0x00000007
#define _ADCCMPEN5_CMPE7_MASK                    0x00000080
#define _ADCCMPEN5_CMPE7_LENGTH                  0x00000001

#define _ADCCMPEN5_CMPE8_POSITION                0x00000008
#define _ADCCMPEN5_CMPE8_MASK                    0x00000100
#define _ADCCMPEN5_CMPE8_LENGTH                  0x00000001

#define _ADCCMPEN5_CMPE9_POSITION                0x00000009
#define _ADCCMPEN5_CMPE9_MASK                    0x00000200
#define _ADCCMPEN5_CMPE9_LENGTH                  0x00000001

#define _ADCCMPEN5_CMPE10_POSITION               0x0000000A
#define _ADCCMPEN5_CMPE10_MASK                   0x00000400
#define _ADCCMPEN5_CMPE10_LENGTH                 0x00000001

#define _ADCCMPEN5_CMPE11_POSITION               0x0000000B
#define _ADCCMPEN5_CMPE11_MASK                   0x00000800
#define _ADCCMPEN5_CMPE11_LENGTH                 0x00000001

#define _ADCCMPEN5_CMPE12_POSITION               0x0000000C
#define _ADCCMPEN5_CMPE12_MASK                   0x00001000
#define _ADCCMPEN5_CMPE12_LENGTH                 0x00000001

#define _ADCCMPEN5_CMPE13_POSITION               0x0000000D
#define _ADCCMPEN5_CMPE13_MASK                   0x00002000
#define _ADCCMPEN5_CMPE13_LENGTH                 0x00000001

#define _ADCCMPEN5_CMPE14_POSITION               0x0000000E
#define _ADCCMPEN5_CMPE14_MASK                   0x00004000
#define _ADCCMPEN5_CMPE14_LENGTH                 0x00000001

